export const getGenreDescription = (genreId, genreMetaList) => {
  const genre = genreMetaList.find((g) => g.id === genreId);
  if (!genre) return "인기 영화";
  console.log(genre.id);
  const genreData = {
    28: "짜릿한 전투의 세계, 액션 영화",
    12: "끝없는 여정을 따라가는 모험 영화",
    16: "상상력 넘치는 애니메이션 이야기",
    35: "웃음 폭발! 유쾌한 코미디 영화",
    80: "범죄의 세계를 파헤치는 영화",
    99: "사실을 바탕으로 한 깊이 있는 이야기",
    18: "인생의 단면을 담은 감성 드라마",
    10751: "함께 보면 좋은 따뜻한 가족 영화",
    14: "현실 너머 마법의 세계, 판타지 영화",
    36: "과거를 되짚는 역사 이야기",
    27: "소름 끼치는 공포의 순간들",
    10402: "음악으로 감정을 전하는 이야기",
    9648: "정답 없는 퍼즐, 미스터리 영화",
    10749: "설렘 가득한 사랑 이야기",
    878: "상상을 뛰어넘는 미래 세계, SF 영화",
    10770: "작지만 강한 이야기, TV 영화",
    53: "긴장감 넘치는 몰입형 스릴러",
    10752: "전장의 기록, 전쟁 영화",
    37: "정의와 대결의 시대, 서부극",
  };

  return genreData[genreId] || "추천 영화";
};
